[
  {
    "id": "d28eac6bbf3a6c9a342800f63e65e5ad",
    "name": "Vertical Bucky Stand",
    "description": "",
    "short_description": ""
  },
  {
    "id": "b30244948a30601d7635a9b9284e30df",
    "name": "EPCOS TDK MHQ1005P5N6CT000 SMD SMT Inductor Coils",
    "description": "",
    "short_description": "Multilayer Non-Magnetic Core (Dielectric Ceramic) Super High Q"
  },
  {
    "id": "705839f967f6246c134252f9f1eb0439",
    "name": "AUTODATA Battery Charger 690V AC 50A",
    "description": "Suitable for all kinds of batteries like Lead Acid Tubular, Lead Acid Plante, VRLA, Ni-cd, Lithium Battery ( programs based on type of battery used) The configurations allow for simultaneous operation of supplying the load and the automatic charging of the battery either in float or boost mode.. The battery feeds the load when main supply is not there. Single Float cum Boost Charger with Single battery and Load Float and Float cum Boost Charger with Single Battery and Load Dual Float Cum Boost Charger with Single Battery and Load Dual Float Cum Boost Charger with Two sets of Battery and Single Load Dual Float Cum Boost Charger with Two sets of Battery and Two sets of Load Single Float Cum Boost Charger with Chopper for Load",
    "short_description": ""
  },
  {
    "id": "b351c47403cd6cf3b760fa3bd313dcb8",
    "name": "Infineon S25FL128LDPBHV023 Quad SPI Memory",
    "description": "",
    "short_description": ""
  },
  {
    "id": "3e51f6bf4f7edd0497243b2dae43a05f",
    "name": "Autoclave High Pressure (Horizontal) Model No : USI - 2550 USI – 2550C : 20”x48” (WxL), 12KW Load",
    "description": "Description Shell Consists of Chamber and jacket. The Chamber is made of thick stainless steel sheet. To minimize the heat loss the shell has been insulated with glass wool and covered with SS 304G cover. The Sheet is mounted on a sturdy MS Tubular Stand. Boiler is fitted with auto pressure control device to set and maintain the chamber pressure. Door and ring is made of thick stainless steel plate. Fitted with Semi-Automatic temperature control system, steam lock mechanism & jointless silicon gasket. Standard Accessories: Water Inlet/Outlet valve, water level indicator with safety valve fitted with boiler, pressure gauge, three-way valve for controlling of sterilizing cycle, auto pressure control system, semi- automatic temp. controller, steam trap wall, low water cut off system with alarm",
    "short_description": ""
  },
  {
    "id": "44ab43403ac62d387574b7c39fc78781",
    "name": "Huber Unichiller 350Tw Recirculating Cooler",
    "description": "Unichillers with cooling capacities of up to 80 kW are circulation coolers in a tower design with a small footprint and an air- or water-cooled chiller. The devices are suitable for cooling industrial and chemical processes and as a central cooling water supply.",
    "short_description": ""
  },
  {
    "id": "5afc677dcf685d71b62bfd72d52f47f6",
    "name": "W14 Hydraulic Wiper Seals 15.00 W140151114 WPS-2179",
    "description": "W14 is a single acting metal-cased wiper seal, designed to press fit into open groove housings for light and medium duty applications. The precision moulded Nitrile rubber (NBR) wiping element is bonded to a metal case treated to prevent rust. The proportions of the NBR wiping lip follow the side movement of the rod to clear away the deposited dirt. W14 also available in Polyurethane material. Due to excellent wear resistance of polyurethane the life expected is 3 times than that of NBR. MATERIAL Nitrile Rubber 85/90 Shore AMild Steel (SS-304/316 on request) OPERATING CONDITIONS Temperature Range : -30° C to + 100° CSpeed : 0.5 m/s SURFACE ROUGHNESS Static : 0.8 µmRaDynamic : 0.4 µmRa COMPATIBILITY Mineral oils, bio oils, water soluble & water glycol fluids. APPLICATION Light to Medium duty machineries.Hydraulic and Pneumatic cylinders. FEATURES General purpose seal.Good wiping performance.Heavy duty application.Long service life.Seal retainer not required.Press fitting into the groove.",
    "short_description": "Mineral oils, water soluble & water glycol fluids. Light to medium duty cylinders.Static load holding (boom lifting to hold hydraulic platforms).Compact cylinders, Machine Tools.Agricultural equipments. Well proven design.Long service life.Short overall length of piston.Excellent load holding capability.Any size upto 500mm available on request. Sealing Ring : Nitrile Rubber 75/80 Shore ABack-up rings : PolyurethaneBearing rings : POM / Nylon Temperature Range : -30° C to + 100° CPressure : 400 BarSpeed : 0.5 m/s Static : 1.6 µmRaDynamic : 0.4 µmRa"
  },
  {
    "id": "cb1b8e5f259c2a25822d82fec77ddc52",
    "name": "L&T Capacity Duty Contactors Type Mo C",
    "description": "",
    "short_description": "Conforms to 60947-4-1 & IEC 60947-4-1 MO C Range available from 3- 100kVAr, AC-6b Delatching type early make contacts Separate termination for damping resistors Encapsulated damping resistor assembly Common coil for 50-60Hz application Low pick-up VA consumption Standard accessories throughout the range in lined with MO contactor Suitable for Lug as well as Lugless termination"
  },
  {
    "id": "2bacb5183e5f4dbb96b7f99f9d4e5184",
    "name": "Cylindrical Horizontal Autoclave Triple Wall DIV - 211",
    "description": "The sterilizer is based on the principle that microbiological action of saturated steam at elevated temperature is rapid and through. All models work on principle of downward displacement of air which is most economical method of obtaining sterilization. Construction:- Dynamic autoclave units are made of stainless steels to ensure corrasion resistance surface triple wall construction ensure excellent level of safety. Equipped With:- The Pressure Control Device, Digital Temperature Controller with Digital Timer & Alarm Low Water Cut off Device, Multiport Valve, silicon gasket, reliable pressure & temperature gauge etc. is incorporated. Operating Temp & Pressure:- Working temperature 1210 Sterilizing Pressure : 1.2 to 1.5 Kg/cm2 (15 psi- 30 psi) Power : Suitable to operate on 440V, 3Ph, 50 Hz, AC Supply Optional Accessories Digital pressure gauge PID/PLC Thermal Printer",
    "short_description": ""
  },
  {
    "id": "39fdfc679b57364cbee3faaa1184bece",
    "name": "TDK C2012X5R2A104M125AA Multilayer Ceramic Chip Capacitors",
    "description": "",
    "short_description": "Mid Voltage (100 to 630V)"
  }
]